In [2]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [3]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns = cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df.head()

F:\Anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     col1  col2
2000-01-01 00:00:00     4    12
2000-01-01 01:00:00    13     2
2000-01-01 02:00:00    17    16
2000-01-01 03:00:00     2    11
2000-01-01 04:00:00     6     4

# Resampling data dengan interval monthly

In [4]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7452
2000-02-29  6979
2000-03-31  7563
2000-04-30  7127
2000-05-31  7268
2000-06-30  7314
2000-07-31  7325
2000-08-31  7534
2000-09-30  7352
2000-10-31  7184
2000-11-30  7431
2000-12-31  7057

# Resampling data dengan interval daily

In [5]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   215
2000-01-02   201
2000-01-03   241
2000-01-04   261
2000-01-05   245
...          ...
2000-12-26   259
2000-12-27   226
2000-12-28   218
2000-12-29   238
2000-12-30   231

[365 rows x 1 columns]